#+title: Turing Complete and Verilog
#+date: 2023-09-04
#+options: _:nil ^:nil
#+layout: post
#+math: true
#+categories: misc
* 手搓二进制?
(该章节对应编程)

+ 加 5 等于几: 相当于就是一个加常数

  #+begin_html
  <details><summary>LISP</summary>
  #+end_html

  #+name: add-five-eqs
  #+begin_src lisp
    (list                                   ; OUTPUT = INPUT
     (instant-number 5)                     ; REG0 = 5
     (copy 0 1)                             ; REG1 = REG0
     (copy 'input 2)                        ; REG2 = INPUT
     (compute 'add)                         ; REG3 = REG1 + REG2
     (copy 3 'output)                       ; OUTPUT = REG3
     )
  #+end_src

  #+RESULTS: add-five-eqs
  | 0 | 0 | 0 | 0 | 0 | 1 | 0 | 1 |
  | 1 | 0 | 0 | 0 | 0 | 0 | 0 | 1 |
  | 1 | 0 | 1 | 1 | 0 | 0 | 1 | 0 |
  | 0 | 1 | 0 | 0 | 0 | 1 | 0 | 0 |
  | 1 | 0 | 0 | 1 | 1 | 1 | 1 | 0 |

  这样还是太麻烦了, 不如...

  #+begin_html
  </details>
  #+end_html
+ 激光炮直瞄: 相当于是正整数乘法, 最朴素的一个做法就是
  \(\lambda a b . (\mathrm{if\ } a = 0, 0 \mathrm{\ else\ } b + Y(a - 1) b)\).

  #+begin_html
  <details><summary>对应代码</summary>
  #+end_html
  #+begin_example
    # λab.(a = 0 -> 0; T -> b + Y(a - 1)b)
    6            # 0:
    reg0_to_reg5 # 1: reg5 <= sum count
    in_to_reg4   # 2: reg4 <= sum result
    reg5_to_reg1 # 3:
    1            # 4: sum count step
    reg0_to_reg2 # 5: 
    sub          # 6: sum count -= 1
    16           # 7: return sum result
    less_eq_0    # 8: if sum count <= 0
    reg3_to_reg5 # 9: sum count -= 1
    reg4_to_reg1 # 10:
    in_to_reg2   # 11:
    add          # 12:
    reg3_to_reg4 # 13: sum result += r
    3            # 14:
    jmp          # 15:
    reg4_to_out  # 16: output sum result
  #+end_example
  #+begin_html
  </details>
  #+end_html
  
  稍微复杂一点的做法会是
  \(\lambda a b . (\mathrm{cond\ } a = 0, 0; even(a), Y(a / 2)(b + b); b + Y(a - 1)b)\).
  当然, 也可以选择不那么漂亮的做法, 因为是正整数常数数乘,
  所以直接把代码变成: \(\lambda r . (\overbrace{r + r + \cdots + r}^6)\) 也不是不行.
  这样的话就一个普通寄存器都不需要用到了:

  #+begin_html
  <details><summary>对应代码</summary>
  #+end_html
  #+begin_example
    in_to_reg1
    in_to_reg2
    add # r + r => 2r
    reg3_to_reg2
    add # 2r + r => 3r
    reg3_to_reg2
    reg3_to_reg1
    add # 3r + 3r => 6r
    reg3_to_out
  #+end_example
  #+begin_html
  </details>
  #+end_html

  (并且这个还快一点呢, 毕竟有折半操作).
+ 太空入侵者: 我现在做的这个代码完全没有一点智能,
  完全就是提前写好动作, 所以没啥意思.
+ 密码锁: 这个自然可以直接枚举历遍 (就是慢了点).

  #+begin_html
  <details><summary>对应代码</summary>
  #+end_html
  #+begin_example
    0            # 0: 
    reg0_to_reg1 # 1: reg1 <= guess number
    label output_guess
    reg1_to_out  # 2: output guess number
    1            # 3: 
    reg0_to_reg2 # 4: 
    add          # 5: guess number += 1
    reg3_to_reg1 # 6:
    output_guess # 7: label at 2
    jmp          # 8:
  #+end_example
  #+begin_html
  </details>
  #+end_html

  #+begin_html
  <details><summary>你一定想说二分法是吧</summary>
  #+end_html
  但是如果可以二分法搜索呢? 但是这里没有除法也没有位运算.
  我也想不到可以怎样不在修改电路的基础上实现左移运算.
  但是虽然这个除法没法实现, 但是可以历遍这个二进制啊:

  #+begin_example
    Algorithm: bin-search
      guess = 0;
      mask = 128;
      if (mask + guess < real)
        guess += mask;
      mask /= 2;
  #+end_example

  道理是这个道理, 但是一开始我是想这样做的:

  #+begin_example
    # init mask => reg4
    mask_128
    jmp

    label init
    0
    reg0_to_reg3 # reg3 <= guess

    label output_guess
    reg3_to_reg1 # reg1 <= reg3 = guess
    reg4_to_reg2 # 
    add
    reg3_to_out  # out = mask + guess
    in_to_reg3
    next_mask
    neq_0
    reg3_to_reg1 # mask + guess => reg1
    sub          # reg3 = guess, guess not change

    label next_mask
    reg5_to_reg0 # move to next mask
    jmp          # next mask place stored in reg5

    label mask_128
    128
    reg0_to_reg4
    mask_64
    reg0_to_reg5 # next mask = 64
    output_guess
    jmp

    # ...
  #+end_example

  然后我就意识到一个致命的问题, 就是这个立即数最多只能写 6 位,
  也就是最大 63. 这样就不能够打表了... 菜狗就不想办法优化了.

  充分说明硬件支持软件, 只靠软件是有局限的 (bushi).
  #+begin_html
  </details>
  #+end_html
+ 时间掩码: 模 4, 不就是取最后两位嘛... AND 一下不就好了.
+ 迷宫: 贴墙靠右 (左也行) 走, 虽然应该就是这么简单,
  但是实际实现还需要一些操作...

  #+begin_html
  <details><summary>具体实现</summary>
  #+end_html
  简单来说应该是:

  #+begin_example
    Algorithm: Maze-Walk-Left
      if (right-road?)
        walk-to-right;
      else if (front-road?)
        walk-to-front;
      else if (left-road?)
        walk-to-left;
      else
        walk-back;
  #+end_example

  变成代码就是:

  #+begin_example
    label exit
    4
    reg0_to_out

    label loop
    # test_right_road
    2
    reg0_to_out  # turn to right
    test_front_road
    reg0_to_reg4
    test
    jmp          # call test

    label test_front_road
    0
    reg0_to_out  # turn to front
    test_left_road
    reg0_to_reg4
    test
    jmp          # call test

    label test_left_road
    0
    reg0_to_out  # turn to left
    walk_back
    reg0_to_reg4
    test
    jmp          # call test

    label walk_back
    0
    reg0_to_out  # turn to back

    label walk   # walk
    1
    reg0_to_out
    loop
    jmp

    label test
    in_to_reg1   # read input
    3
    reg0_to_reg2
    sub
    exit
    eq_0         # input = 3 => exit
    1
    reg0_to_reg2
    sub
    reg4_to_reg0 # reg4 <= next condition
    eq_0         # input = 1 => wall => next condition
    walk         # if not 3 or 1, just walk
    jmp
  #+end_example
  #+begin_html
  </details>
  #+end_html

